hathach/tinyusb/hw/bsp/at32f403a_407/boards/AT_START_F403A_407/AT32F407xx_v2.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TMR10">
      <name>TMR11</name>
      <baseAddress>0x40015400</baseAddress>
      <interrupt>
        <name>TMR1_TRG_HALL_TMR11</name>
        <description>TMR1 trigger and HALL interrupts and
        TMR11 global interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ACC</name>
      <description>HICK Auto Clock Calibration</description>
      <groupName>ACC</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RSLOST</name>
              <description>Reference Signal Lost</description>
              <access>read-write</access>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALRDY</name>
              <description>Internal high-speed clock calibration ready</description>
              <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <displayName>CTRL1</displayName>
          <description>control register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x0100</resetValue>
          <fields>
            <field>
              <name>STEP</name>
              <description>STEP</description>
              <access>read-write</access>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CALRDYIEN</name>
              <description>CALRDY interrupt enable</description>
              <access>read-write</access>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIEN</name>
              <description>RSLOST error interrupt enable</description>
              <access>read-write</access>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENTRIM</name>
              <description>Enable trim</description>
              <access>read-write</access>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALON</name>
              <description>Calibration on</description>
              <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>control register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x2080</resetValue>
          <fields>
            <field>
              <name>HICKTWK</name>
              <description>Internal high-speed auto clock trimming</description>
              <access>read-only</access>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>HICKCAL</name>
              <description>Internal high-speed auto clock calibration</description>
              <access>read-only</access>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1</name>
          <displayName>C1</displayName>
          <description>compare value 1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x1F2C</resetValue>
          <fields>
            <field>
              <name>C1</name>
              <description>Compare 1</description>
              <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2</name>
          <displayName>C2</displayName>
          <description>compare value 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x1F40</resetValue>
          <fields>
            <field>
              <name>C2</name>
              <description>Compare 2</description>
              <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C3</name>
          <displayName>C3</displayName>
          <description>compare value 3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x1F54</resetValue>
          <fields>
            <field>
              <name>C3</name>
              <description>Compare 3</description>
              <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TMR10">
      <name>TMR13</name>
      <baseAddress>0x40001C00</baseAddress>
      <interrupt>
        <name>TMR8_OVF_TMR13</name>
        <description>TMR8 overflow interrupt and TMR13 global
        interrupt</description>
        <value>44</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TMR10">
      <name>TMR14</name>
      <baseAddress>0x40002000</baseAddress>
      <interrupt>
        <name>TMR8_TRG_HALL_TMR14</name>
        <description>TMR8 trigger and HALL interrupts and
        TMR14 global interrupt</description>
        <value>45</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TMR6</name>
      <description>Basic timer</description>
      <groupName>TIMER</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR6</name>
        <description>TMR6 global interrupt</description>
        <value>54</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL1</name>
          <displayName>CTRL1</displayName>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PRBEN</name>
              <description>Period buffer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCMEN</name>
              <description>One cycle mode enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFS</name>
              <description>Overflow event source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFEN</name>
              <description>Overflow event enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMREN</name>
              <description>TMR enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PTOS</name>
              <description>Primary TMR output selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDEN</name>
          <displayName>IDEN</displayName>
          <description>Interrupt/DMA enable register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OVFDEN</name>
              <description>Overflow DMA request enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFIEN</name>
              <description>Overflow interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISTS</name>
          <displayName>ISTS</displayName>
          <description>Interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OVFIF</name>
              <description>Overflow interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEVT</name>
          <displayName>SWEVT</displayName>
          <description>Software event register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OVFSWTR</name>
              <description>Overflow event triggered by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CVAL</name>
          <displayName>CVAL</displayName>
          <description>Counter value</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CVAL</name>
              <description>Counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV</name>
          <displayName>DIV</displayName>
          <description>Divider value</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>Divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Period value</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PR</name>
              <description>Period value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
