hathach/tinyusb/hw/bsp/at32f403a_407/boards/AT_START_F403A_407/AT32F407xx_v2.svd
        <register>
          <name>SLIB_STS1</name>
          <displayName>SLIB_STS1</displayName>
          <description>sLib status 1 register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLIB_SS</name>
              <description>sLib start sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLIB_DAT_SS</name>
              <description>sLib data start sector</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLIB_ES</name>
              <description>sLib end sector</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>  
        <register>
          <name>SLIB_PWD_CLR</name>
          <displayName>SLIB_PWD_CLR</displayName>
          <description>SLIB password clear register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>write-only</access>
          <fields>
            <field>
              <name>SLIB_PCLR_VAL</name>
              <description>sLib password clear value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLIB_MISC_STS</name>
          <displayName>SLIB_MISC_STS</displayName>
          <description>sLib misc status register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>SLIB_PWD_ERR</name>
              <description>sLib password error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLIB_PWD_OK</name>
              <description>sLib password ok</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLIB_ULKF</name>
              <description>sLib unlock flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLIB_RCNT</name>
              <description>sLib remaining count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>  
        <register>
          <name>SLIB_SET_PWD</name>
          <displayName>SLIB_SET_PWD</displayName>
          <description>sLib password setting register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>write-only</access>
          <fields>
            <field>
              <name>SLIB_PSET_VAL</name>
              <description>sLib password setting val</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>  
        <register>
          <name>SLIB_SET_RANGE</name>
          <displayName>SLIB_SET_RANGE</displayName>
          <description>Configure sLib range register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>write-only</access>
          <fields>
            <field>
              <name>SLIB_SS_SET</name>
              <description>sLib start sector setting,valid input: 0~511</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SLIB_DSS_SET</name>
              <description>sLib data start sector setting,valid input: 0~511, 0 means no data area</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SLIB_ES_SET</name>
              <description>sLib end sector setting,valid input: 0~511</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>  
        <register>
          <name>SLIB_UNLOCK</name>
          <displayName>SLIB_UNLOCK</displayName>
          <description>sLib unlock register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>write-only</access>
          <fields>
            <field>
              <name>SLIB_UKVAL</name>
              <description>sLib unlock key value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_CTRL</name>
          <displayName>CRC_CTRL</displayName>
          <description>CRC controler register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>write-only</access>
          <fields>
            <field>
              <name>CRC_SS</name>
              <description>CRC start sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CRC_SN</name>
              <description>CRC sector numbler</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CRC_STRT</name>
              <description>CRC start</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_CHKR</name>
          <displayName>CRC_CHKR</displayName>
          <description>CRC check result register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
          <fields>
            <field>
              <name>CRC_CHKR</name>
              <description>CRC check result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
